ChartsOfCharacteristicTypes/МИКО_мвНастройкиМаршрутизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>МИКО_мвНастройкиМаршрутизации</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>6</v8:Digits>
					<v8:FractionDigits>0</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>256</v8:Length>
				</v8:StringQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.МИКО_мвНастройкиМаршрутизации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗначений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

InformationRegisters/МИКО_мвДанныеПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МИКО_мвДанныеПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчаствуетВГолосовомМеню</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО_РП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО_ДП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО_ВП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО_ТП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО_ПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолПользователя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МИКО_мвПолПользователей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МИКО_мвТаблицаМаршрутизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МИКО_мвТаблицаМаршрутизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МИКО_мвЗначимыеСобытияДляМаршрутизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МИКО_мвЗначимыеСобытияДляМаршрутизации</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МИКО_мвВидыЗначимыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньЗначимости</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МИКО_мвРегистрируемыеСобытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИндексСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/МИКО_мвВидыЗначимыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>МИКО_мвВидыЗначимыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВходящийЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсходящийЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактВТечениеДня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/МИКО_мвПолПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>МИКО_мвПолПользователей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/МИКО_мвРегистрируемыеСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>МИКО_мвРегистрируемыеСобытия</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МИКО_мвВидыЗначимыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствиеРеквизитов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПоляОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ChartsOfCharacteristicTypes/МИКО_мвНастройкиМаршрутизации/Forms/ФормаНастроек/Ext/Form/Module.bsl
// #Область СлужебныеПроцедурыИФункции

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ.

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТестНомерДляПриветствия = "74952293042";	
	// Видимость элементов формы
	MIKO_Asterisk_Подключена = Метаданные.Обработки.Найти("MIKO_Asterisk")<>Неопределено;
	МИКО_ПанельТелефонииДля1С_Подключена = Метаданные.Обработки.Найти("МИКО_ПанельТелефонииДля1С")<>Неопределено;
	ПанельТелефонииЕсть = (MIKO_Asterisk_Подключена ИЛИ МИКО_ПанельТелефонииДля1С_Подключена);
	Элементы.ПрослушатьПриветствиеБезОтветственных.Видимость = ПанельТелефонииЕсть;
	Элементы.ПрослушатьПриветствие.Видимость 				 = ПанельТелефонииЕсть;
	Элементы.ПрослушатьПриветствиеОкончание.Видимость 		 = ПанельТелефонииЕсть;
	
	// Создадим элемент стиля "шрифт" для выделения заголовков элементов формы.
	ШрифтВыделения = Новый Шрифт(ШрифтыСтиля.ШрифтТекста,,10,Истина);
	
	ЗагрузитьНастройки();
	
	Если ПустаяСтрока(ПоставщикУслуг) Тогда
		ПоставщикУслуг = Элементы.ПоставщикУслуг.СписокВыбора[0].Значение;
	КонецЕсли;
	
	ОбновитьПримерОповещенияГолосовогоМеню();
	ОбновитьСписокДикторов();
	ОбновитьИнтерфейсФормы();
	
	// Получим системную информацию
	СтруктураДанных = МИКО_стСлужебный.ПолучитьСлужебнуюИнформацию();
	ВерсияПлатформы = СтруктураДанных.ВерсияПлатформы;
	ИспользоватьРежимМодальности = СтруктураДанных.ИспользоватьРежимМодальности;
	
	// Попробуем установитьсвойство формы "ВертикальнаяПрокрутка" в значение "Авто".
	Попытка
		врПараметры = Новый Структура("ВертикальнаяПрокрутка");
		ЗаполнитьЗначенияСвойств(врПараметры, ЭтаФорма);
		Если врПараметры.ВертикальнаяПрокрутка <> Неопределено Тогда
			Выполнить("ЭтаФорма.ВертикальнаяПрокрутка = ВертикальнаяПрокруткаФормы.Авто");
		КонецЕсли; 
	Исключение
	КонецПопытки;
	
	ПриСозданииНаСервереСписокСотрудников();
	ПолучитьРегламентныеЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если ЭтаФорма.Модифицированность Тогда
		
		Если (ВерсияПлатформы = "8.2" ИЛИ ИспользоватьРежимМодальности) Тогда
			Ответ = Вопрос("Сохранить изменения перед выходом?", РежимДиалогаВопрос.ДаНетОтмена);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				СохранитьНастройки();
			ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
				ЭтаФорма.Модифицированность = Ложь;
			КонецЕсли;
		Иначе
			Попытка	
				Выполнить("ПоказатьВопрос(
				|Новый ОписаниеОповещения(""ПослеОтветаНаВопрос"", ЭтаФорма, Новый Структура(""Вопрос"", ""СохранитьНастройки"")),
				|""Сохранить изменения перед выходом?"", РежимДиалогаВопрос.ДаНетОтмена)");
				
				Отказ = Истина;
			Исключение
				Возврат;
			КонецПопытки; 
		КонецЕсли;  
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ.

&НаКлиенте
Процедура ИспользоватьСинтезРечиДляГолосовогоМенюПриИзменении(Элемент)
	
	ОбновитьИнтерфейсФормы();

КонецПроцедуры

&НаКлиенте
Процедура ПровайдерПриИзменении(Элемент)
	
	ОбновитьСписокДикторов();
	ОбновитьИнтерфейсФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОптимизацияРасходовПриИзменении(Элемент)
	
	ОбновитьИнтерфейсФормы();
	
КонецПроцедуры

///
// Настройка расписания заданий
///

&НаСервере 
// Получение регламентных заданий по подсистеме "ИсторияЗвонков"
// 
Процедура ПолучитьРегламентныеЗадания()
	Задания.Очистить();
	
	ВсеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания();
	Для каждого Задание Из ВсеЗадания Цикл
		Имя = Задание.Метаданные.Имя;
		Если Элементы.Найти(Имя)=Неопределено Тогда
			Продолжить;
		КонецЕсли; 			
		Элементы[Имя].Заголовок = "" + Задание.Расписание;
		
		ПоляЗадания = Задания.Добавить();
		ПоляЗадания.УникальныйИдентификатор = Задание.УникальныйИдентификатор;
		ПоляЗадания.Имя 					= Имя;
		ПоляЗадания.Представление 			= Задание.Метаданные.Синоним;
		ПоляЗадания.Расписание 				= Задание.Расписание;
	КонецЦикла; 
КонецПроцедуры 

&НаКлиенте
// Обработка изменения расписания регламентного задания
//
Процедура ВыбратьРасписание(Расписание, ДопПараметры) Экспорт
	Если Расписание = Неопределено Тогда
		// не изменили расписание, просто закрыли форму 
		Возврат;
	КонецЕсли; 
				
	Если Не ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
		// это не верное оповещение
		Возврат;
	КонецЕсли; 
	
	СохранитьРасписаниеЗадания(ДопПараметры.УникальныйИдентификатор, Расписание);
КонецПроцедуры

// Сохранить расписание задания.
//
// Параметры:
//  УникальныйИдентификатор  - <тип - УникальныйИдентификатор> - идентификатор регламентного задания.
//  Расписание  - <РасписаниеРегламентногоЗадания> - новое значение расписания.
//
&НаСервере
Процедура СохранитьРасписаниеЗадания(УИД, Расписание)

	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(УИД);
	Если Задание = Неопределено Тогда
		// передан не верный идентификатор
		Возврат;			
	КонецЕсли; 
	// правим расписание
	Задание.Расписание = Расписание;
	Задание.Записать();	

	ПолучитьРегламентныеЗадания();
КонецПроцедуры // СохранитьРасписаниеЗадания()

&НаКлиенте
// Обработка нажатия на гиперссылку регламентного задания.
// 
Процедура ИзменениеРасписанияНажатие(Элемент)
	
	ВсеЗадания = Задания.НайтиСтроки(Новый Структура("Имя", Элемент.Имя));
	Если ВсеЗадания.Количество()=0 Тогда
		Возврат;
	КонецЕсли; 	
	
	// пробуем менять расписание
	УИД = ВсеЗадания[0].УникальныйИдентификатор; 
	Имя = ВсеЗадания[0].Имя;
	Расписание = ВсеЗадания[0].Расписание;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("УникальныйИдентификатор",УИД);	
	ДопПараметры.Вставить("Имя",Имя);
	
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);	
	
	Если ВерсияПлатформы = "8.3" Тогда
		
		Если НЕ ИспользоватьРежимМодальности Тогда
		
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ВыбратьРасписание"", ЭтаФорма, ДопПараметры)");
			Попытка	
				Выполнить("Диалог.Показать(ОписаниеОповещения)");
			Исключение
				Возврат;
			КонецПопытки; 
			
		Иначе	
			ЗначениеРасписания = Диалог.ОткрытьМодально();
			УстановитьРасписаниеНаСервере(УИД, Диалог.Расписание);
			ПолучитьРегламентныеЗадания();
		КонецЕсли; 
		
		
	ИначеЕсли ВерсияПлатформы = "8.2" Тогда
		ЗначениеРасписания = Диалог.ОткрытьМодально();
		УстановитьРасписаниеНаСервере(УИД, Диалог.Расписание);
		ПолучитьРегламентныеЗадания();
	КонецЕсли; 
	
КонецПроцедуры
 
&НаСервереБезКонтекста
// Установка расписания для регламентного задания.
// 
Процедура УстановитьРасписаниеНаСервере(РеглЗаданиеУИД, Знач Расписание)

	РеглЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РеглЗаданиеУИД);
	РеглЗадание.Расписание = Расписание;
	РеглЗадание.Записать();
	
КонецПроцедуры // ()

////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ ФОРМЫ

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Элементы.ДикторГолосовогоМеню.ТекстРедактирования) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите диктора для генерации речи.";
		Сообщение.Поле = "ДикторГолосовогоМеню";
		Сообщение.УстановитьДанные(ДикторГолосовогоМеню);
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 
	
	СохранитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрослушатьПриветствие(Команда)
	
	ПрослушатьПриветствиеНаСервере();
	ЗапроситьОбратныйЗвонокСГолосомДиктора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрослушатьПриветствиеБезОтветственных(Команда)
	
	ПрослушатьПриветствиеБезОтветственныхНаСервере();
	ЗапроситьОбратныйЗвонокСГолосомДиктора();
	
КонецПроцедуры

&НаСервере
Процедура ПрослушатьПриветствиеНаСервере()
	
	Сотрудники1С = ПланыВидовХарактеристик.МИКО_мвНастройкиМаршрутизации.СформироватьСписокСотрудников(ПадежСклоненияИменСотрудников, СоставИмениСотрудников);
	Ключ = ?(ПоставщикУслуг = "Yandex",КлючAPI_Yandex, КлючAPI_CRT);
	ДанныеПриветствия = Новый Структура;
	ДанныеПриветствия.Вставить("Приветствие", ПриветствиеГолосовогоМеню);
	ДанныеПриветствия.Вставить("Сотрудники",  Сотрудники1С);
	ДанныеПриветствия.Вставить("Окончание",   ОкончаниеГолосовогоМеню);
	// Добавим дополнительный параметры
	ДанныеПриветствия.Вставить("Параметры", Новый Структура);
	ДанныеПриветствия.Параметры.Вставить("Поставщик",   ПоставщикУслуг);
	ДанныеПриветствия.Параметры.Вставить("КлючAPI",     Ключ);
	ДанныеПриветствия.Параметры.Вставить("Диктор",      ДикторГолосовогоМеню);
	ДанныеПриветствия.Параметры.Вставить("Оптимизация", ОптимизацияРасходов);
	
	ПодготовитьСистемуКВоспроизведению(ДанныеПриветствия);
	
КонецПроцедуры

&НаСервере
Процедура ПрослушатьПриветствиеБезОтветственныхНаСервере()
	Ключ = ?(ПоставщикУслуг = "Yandex",КлючAPI_Yandex, КлючAPI_CRT);
	ДанныеПриветствия = Новый Структура;
	ДанныеПриветствия.Вставить("Приветствие", ПриветствиеГолосовогоМенюБезОтветственных);
	ДанныеПриветствия.Вставить("Сотрудники",  Новый Массив);
	ДанныеПриветствия.Вставить("Окончание",   "");
	// Добавим дополнительный параметры
	ДанныеПриветствия.Вставить("Параметры", Новый Структура);
	ДанныеПриветствия.Параметры.Вставить("Поставщик",   ПоставщикУслуг);
	ДанныеПриветствия.Параметры.Вставить("КлючAPI",     Ключ);
	ДанныеПриветствия.Параметры.Вставить("Диктор",      ДикторГолосовогоМеню);
	ДанныеПриветствия.Параметры.Вставить("Оптимизация", ОптимизацияРасходов);
	
	ПодготовитьСистемуКВоспроизведению(ДанныеПриветствия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуМаршрутизации(Команда)
	
	Если (ВерсияПлатформы = "8.2" ИЛИ ИспользоватьРежимМодальности) Тогда
		Ответ = Вопрос("Внимание! Процедура может занять длительное время. Продолжить?", РежимДиалогаВопрос.ДаНет,,); 
		Если Ответ = КодВозвратаДиалога.Нет Тогда
    		Возврат;
		КонецЕсли;
		ОбновитьТаблицуМаршрутизацииНаСервере();
	Иначе	
		Выполнить("ПоказатьВопрос(Новый ОписаниеОповещения(""ПослеОтветаНаВопрос"", 
		|ЭтаФорма, Новый Структура(""Вопрос"", ""ОбновитьТаблицуМаршрутизации"")), 
		|""Внимание! Процедура может занять длительное время. Продолжить?"", РежимДиалогаВопрос.ДаНет)");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СформироватьТекстПриветствия(Команда)
	
	// Получим системную информацию
	СтруктураДанных = МИКО_стСлужебный.ПолучитьСлужебнуюИнформацию();
	ВерсияПлатформы = СтруктураДанных.ВерсияПлатформы;
	ИспользоватьРежимМодальности = СтруктураДанных.ИспользоватьРежимМодальности;
	
	Подсказка = "Укажите номер телефона клиента для формирования приветствия";
	Если ЗначениеЗаполнено(ТестНомерДляПриветствия) Тогда
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю(СформироватьСтрокуПриветствия(ТестНомерДляПриветствия));
	Иначе
		МИКО_стОбщегоНазначенияКлиент.СообщитьПользователю("Не указан номер телефона!");
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ АСИНХРОННЫХ ОТВЕТОВ

&НаКлиенте
Процедура ПослеВводаСтроки(Строка, Параметры) Экспорт
	
	РеквизитФормы = "";
	Если Строка <> Неопределено И Параметры.Свойство("Реквизит", РеквизитФормы) Тогда
		ЭтаФорма[РеквизитФормы] = Строка;
		ЭтаФорма.Модифицированность = Истина;
		
		ОбновитьПримерОповещенияГолосовогоМеню();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЭлементаМеню(ВыбранныйЭлемент, Параметры) Экспорт
	
	ВидМеню = "";	
	Если ВыбранныйЭлемент <> Неопределено И Параметры.Свойство("Меню", ВидМеню) Тогда
		
		Если ВидМеню = "#Сотрудники" Тогда
		
			Если ВыбранныйЭлемент.Значение = "ИзменитьПадеж" Тогда
				
				ЭлементыМеню = Новый СписокЗначений();
				ЭлементыМеню.Добавить(1, "Именительный (Кто?)");
				ЭлементыМеню.Добавить(2, "Родительный (Нет кого?)");
				ЭлементыМеню.Добавить(3, "Дательный (Кому?)");
				ЭлементыМеню.Добавить(4, "Винительный (Кого?)");
				ЭлементыМеню.Добавить(5, "Творительный (Кем?)");
				ЭлементыМеню.Добавить(6, "Предложный (О ком?)");
				Если (ВерсияПлатформы = "8.2" ИЛИ ИспользоватьРежимМодальности) Тогда
					ВыбранныйЭлемент = ВыбратьИзМеню(ЭлементыМеню, Элементы.ИзменитьПадеж);
					ПослеВыбораЭлементаМеню(ВыбранныйЭлемент, Новый Структура("Меню", "#Падежи"));
				Иначе
					Выполнить("ПоказатьВыборИзМеню(
							|Новый ОписаниеОповещения(""ПослеВыбораЭлементаМеню"", ЭтаФорма, Новый Структура(""Меню"", ""#Падежи"")),
							|ЭлементыМеню,
							|Элементы.ИзменитьПадеж)");
				КонецЕсли;
			ИначеЕсли ВыбранныйЭлемент.Значение = "ИзменитьСоставИмени" Тогда
				
				ЭлементыМеню = Новый СписокЗначений();
				ЭлементыМеню.Добавить(0, "Фамилия, имя, отчество");
				ЭлементыМеню.Добавить(1, "Фамилия, имя");
				ЭлементыМеню.Добавить(2, "Имя, отчество");
				Если (ВерсияПлатформы = "8.2" ИЛИ ИспользоватьРежимМодальности) Тогда
					ВыбранныйЭлемент = ВыбратьИзМеню(ЭлементыМеню, Элементы.ИзменитьПадеж);
					ПослеВыбораЭлементаМеню(ВыбранныйЭлемент, Новый Структура("Меню", "#СоставИмени"));
				Иначе
				
					Выполнить("ПоказатьВыборИзМеню(
								|Новый ОписаниеОповещения(""ПослеВыбораЭлементаМеню"", ЭтаФорма, Новый Структура(""Меню"", ""#СоставИмени"")),
								|ЭлементыМеню,
								|Элементы.ИзменитьСоставИмени)");
				КонецЕсли;
			КонецЕсли;
				
		ИначеЕсли ВидМеню = "#Падежи" Тогда
			
			ПадежСклоненияИменСотрудников = ВыбранныйЭлемент.Значение;
			
			ЭтаФорма.Модифицированность = Истина;
			
			ОбновитьПримерОповещенияГолосовогоМеню();
			
		ИначеЕсли ВидМеню = "#СоставИмени" Тогда
			
			СоставИмениСотрудников = ВыбранныйЭлемент.Значение;
			
			ЭтаФорма.Модифицированность = Истина;
			
			ОбновитьПримерОповещенияГолосовогоМеню();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Ответ, Параметры) Экспорт
	
	Вопрос = "";
	Если Ответ <> Неопределено И Параметры.Свойство("Вопрос", Вопрос) Тогда
		
		Если Вопрос = "СохранитьНастройки" Тогда
			
			Если Ответ = КодВозвратаДиалога.Да Тогда
				СохранитьНастройки();
				Закрыть();
			ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
				ЭтаФорма.Модифицированность = Ложь;
				Закрыть();
			КонецЕсли;
		ИначеЕсли Вопрос = "ОбновитьТаблицуМаршрутизации" Тогда
			
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Возврат;
			КонецЕсли;
			
			ОбновитьТаблицуМаршрутизацииНаСервере();
			
		КонецЕсли;
        
    КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ НАСТРОЙКАМИ.
&НаСервере 
Процедура ЗагрузитьНастройки()
	
	// Загружаем настройки из базы
	Запрос = Новый Запрос;
		
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИКО_мвНастройкиМаршрутизации.Наименование КАК Параметр,
		|	МИКО_мвНастройкиМаршрутизации.Значение
		|ИЗ
		|	ПланВидовХарактеристик.МИКО_мвНастройкиМаршрутизации КАК МИКО_мвНастройкиМаршрутизации
		|ГДЕ
		|	МИКО_мвНастройкиМаршрутизации.ЭтоГруппа = ЛОЖЬ
		|	И МИКО_мвНастройкиМаршрутизации.Предопределенный = ИСТИНА
		|	И МИКО_мвНастройкиМаршрутизации.Родитель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.МИКО_мвНастройкиМаршрутизации.ОповещениеГолосовогоМеню)";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаНастроек = РезультатЗапроса.Выгрузить();
	
	СписокПараметров.ЗагрузитьЗначения(ТаблицаНастроек.ВыгрузитьКолонку("Параметр"));
	
	// Заполняем настройки
	Для Каждого СтрокаНастройки Из ТаблицаНастроек Цикл
		
		ЭтаФорма[СтрокаНастройки.Параметр] = СтрокаНастройки.Значение;
		
	КонецЦикла;
	
	// Заполним значения по умолчанию
	Если ПустаяСтрока(ПриветствиеГолосовогоМеню) И ПустаяСтрока(ОкончаниеГолосовогоМеню) Тогда
		
		ПриветствиеГолосовогоМеню = 
			"Вас приветствует компания МИКО, официальный партнер фирмы 1С в Зеленограде. Ранее Вы общались с";
			
		ОкончаниеГолосовогоМеню = 
			"Для связи с отделом продаж наберите 90";
			
		Модифицированность = Истина;
		
	КонецЕсли;
	
	Если ПустаяСтрока(ПриветствиеГолосовогоМенюБезОтветственных) Тогда
	
		ПриветствиеГолосовогоМенюБезОтветственных = "Вас приветствует компания МИКО, официальный партнер фирмы 1С в Зеленограде";	
		Модифицированность = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры // ЗагрузитьНастройки()

&НаСервере 
Процедура СохранитьНастройки()

	Для Каждого элПараметр Из СписокПараметров Цикл
		ПараметрОбъект = ПланыВидовХарактеристик.МИКО_мвНастройкиМаршрутизации[элПараметр.Значение].ПолучитьОбъект();
		
		Если "ДикторГолосовогоМенюБезОтветственных" = элПараметр.Значение Тогда
			ИмяРеквизита = "ДикторГолосовогоМеню";
		ИначеЕсли "КлючAPI" = элПараметр.Значение Тогда
			ИмяРеквизита = "КлючAPI_"+ПоставщикУслуг;	
		Иначе
			ИмяРеквизита = элПараметр.Значение;
		КонецЕсли; 
		
		ПараметрОбъект.Значение = ЭтаФорма[ИмяРеквизита];
		ПараметрОбъект.Записать();
	КонецЦикла;
	
	СотрудникиСохранитьНаСервере();
	ЭтаФорма.Модифицированность = Ложь;

КонецПроцедуры // СохранитьНастройки()


////////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ ВНЕШНИМ ВИДОМ ФОРМЫ.
&НаСервере 
Процедура ОбновитьПримерОповещенияГолосовогоМеню()
	
	врСотрудники = ПланыВидовХарактеристик.МИКО_мвНастройкиМаршрутизации.СформироватьСписокСотрудников(ПадежСклоненияИменСотрудников, СоставИмениСотрудников);
		
	СтрПриветствие                 = ?(ПустаяСтрока(ПриветствиеГолосовогоМеню),                 "<Пусто>", ПриветствиеГолосовогоМеню);
	СтрПриветствиеБезОтветственных = ?(ПустаяСтрока(ПриветствиеГолосовогоМенюБезОтветственных), "<Пусто>", ПриветствиеГолосовогоМенюБезОтветственных);
	СтрОкончание                   = ?(ПустаяСтрока(ОкончаниеГолосовогоМеню),                   "<Пусто>", ОкончаниеГолосовогоМеню);
	СтрСотрудники                  = ?(врСотрудники.Количество()=0,                  			"<Не настроен список сотрудников>", МИКО_стОбщегоНазначения.СтрокаИзМассиваПодстрок(врСотрудники, ".")+". ");
	
	НадписьПриветствиеСотрудники = СтрСотрудники;
				
КонецПроцедуры // ОбновитьПримерОповещенияГолосовогоМеню()
&НаСервере 
Процедура ОбновитьСписокДикторов()
	
	Элементы.ДикторГолосовогоМеню.СписокВыбора.Очистить();
	Элементы.ДикторГолосовогоМенюБезОтветственных.СписокВыбора.Очистить();
	
	Если ПоставщикУслуг = "CRT" Тогда
		
		// Для ЦРТ список можно скачать с сайта
		Попытка
			СписокДикторов = ПланыВидовХарактеристик.МИКО_мвНастройкиМаршрутизации.ЗагрузитьСписокДикторов();
			МИКО_стОбщегоНазначения.ЗаполнитьКоллекциюСвойств(Элементы.ДикторГолосовогоМеню.СписокВыбора, СписокДикторов);
			МИКО_стОбщегоНазначения.ЗаполнитьКоллекциюСвойств(Элементы.ДикторГолосовогоМенюБезОтветственных.СписокВыбора, СписокДикторов);
		Исключение
		КонецПопытки;
		
	ИначеЕсли ПоставщикУслуг = "Yandex" Тогда
		 
		ДикторыЯндекс = Новый СписокЗначений;
		ДикторыЯндекс.Добавить("jane",  "Жанна");
		ДикторыЯндекс.Добавить("omazh", "Василиса"); // гугл говорит, omazh - вассал )
		ДикторыЯндекс.Добавить("zahar", "Захар");
		ДикторыЯндекс.Добавить("ermil", "Ермил");
		
		МИКО_стОбщегоНазначения.ЗаполнитьКоллекциюСвойств(Элементы.ДикторГолосовогоМеню.СписокВыбора, ДикторыЯндекс);
		МИКО_стОбщегоНазначения.ЗаполнитьКоллекциюСвойств(Элементы.ДикторГолосовогоМенюБезОтветственных.СписокВыбора, ДикторыЯндекс);
		
	КонецЕсли;
	
КонецПроцедуры // ОбновитьСписокДикторов()
&НаСервере 
Процедура ОбновитьИнтерфейсФормы()
	
	// Управляем доступом к элементам управления голосового меню
	Элементы.ГруппаСинтезРечиДляГолосовогоМенюТело.Доступность = ИспользоватьСинтезРечиДляГолосовогоМеню;
	Элементы.СтраницаТекстIVR.Доступность = ИспользоватьСинтезРечиДляГолосовогоМеню;
	Элементы.СтраницаДополнительно.Доступность = ИспользоватьСинтезРечиДляГолосовогоМеню;
	Элементы.Сотрудники.Доступность = ИспользоватьСинтезРечиДляГолосовогоМеню;
	
	
	Если Элементы.Найти("СтраницаПояснение" + ПоставщикУслуг) <> Неопределено Тогда
		// Отображаем настройки поставщика
		Элементы.СтраницыПояснениеКПоставщикам.ТекущаяСтраница = Элементы["СтраницаПояснение" + ПоставщикУслуг];
	КонецЕсли; 
	
	Если ПоставщикУслуг = "CRT" Тогда
		Элементы.КлючAPI_Yandex.Видимость = Ложь;
		Элементы.КлючAPI_CRT.Видимость    = Истина;
	ИначеЕсли ПоставщикУслуг = "Yandex" Тогда	
		Элементы.КлючAPI_Yandex.Видимость = Истина;
		Элементы.КлючAPI_CRT.Видимость    = Ложь;
	КонецЕсли; 
	
КонецПроцедуры // ОбновитьИнтерфейсФормы()


////////////////////////////////////////////////////////////////////////////////
// ПРОЧЕЕ.

// Сохраняет в ИБ необходимую информацию для воспроизведения голосового приветствия
// посредством обратного звонка.
&НаСервереБезКонтекста
Процедура ПодготовитьСистемуКВоспроизведению(ДанныеПриветствия)
	
	ТекстВФорматеАТС = МИКО_мвМаршрутизацияЗвонков.СформироватьДанныеСтрокиПриветствияДляАТС(ДанныеПриветствия);
	
	Константы.МИКО_мвПримерПриветствия.Установить(ТекстВФорматеАТС);
	
КонецПроцедуры // ПодготовитьСистемуКВоспроизведению()

&НаКлиенте
Процедура ЗапроситьОбратныйЗвонокСГолосомДиктора()
	
	врДанные = Новый Структура("НомерТелефона,CallerID", "10000123", "777777777");
	Оповестить("ТестУмнойМаршрутизации", врДанные);
	
КонецПроцедуры // ЗапроситьОбратныйЗвонокСГолосомДиктора()

&НаСервереБезКонтекста
Процедура ОбновитьТаблицуМаршрутизацииНаСервере()
	
	Попытка
		// Перезаполним таблицу значимых событий
		ОбновитьТаблицуЗначимыхСобытий();
		// Обновим таблицу маршрутизации
		МИКО_мвМаршрутизацияЗвонковСервер.ОбновитьТаблицуМаршрутизации();
	Исключение
		ЗаписьЖурналаРегистрации("МИКО.мвОбновитьТаблицуМаршрутизации",  УровеньЖурналаРегистрации.Предупреждение, , ,  "Ошибка запуска регламентной задачи: " + ОписаниеОшибки());
	КонецПопытки; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьТаблицуЗначимыхСобытий()
	Попытка
		мМИКО_мвМаршрутизацияЗвонковСервер = Вычислить("МИКО_мвМаршрутизацияЗвонковСервер");	
	Исключение
		Возврат;	
	КонецПопытки; 
	// Определим, по каким документов фиксируется информация
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мвРегистрируемыеСобытия.ВидСобытия,
		|	мвРегистрируемыеСобытия.ВидОбъекта,
		|	мвРегистрируемыеСобытия.Вес,
		|	мвРегистрируемыеСобытия.СрокДействия,
		|	мвРегистрируемыеСобытия.Предопределенный,
		|	тчСоответствиеРеквизитов.НаименованиеПоляОбъекта КАК НаименованиеПоляДата
		|ИЗ
		|	Справочник.МИКО_мвРегистрируемыеСобытия КАК мвРегистрируемыеСобытия
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МИКО_мвРегистрируемыеСобытия.СоответствиеРеквизитов КАК тчСоответствиеРеквизитов
		|		ПО (тчСоответствиеРеквизитов.Ссылка = мвРегистрируемыеСобытия.Ссылка)
		|			И (тчСоответствиеРеквизитов.НаименованиеПоля = ""Дата"")
		|ГДЕ
		|	мвРегистрируемыеСобытия.ПометкаУдаления = ЛОЖЬ";
		
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаВидовСобытий = РезультатЗапроса.Выгрузить();
	
	// Подготовим запрос для выбора списка документов, по которым будем собирать
	// информацию для таблицы значимых событий.
	
	ТекстЗапросаПоОбъектам = "";
	Для Каждого СтрокаТЗ Из ТаблицаВидовСобытий Цикл
		
		ТекстЗапросаПоОбъекту =
			"ВЫБРАТЬ
			|	Объект.Ссылка
			|ИЗ
			|	%ВидСобытия%.%ВидОбъекта% КАК Объект
			|ГДЕ
			|	Объект.%Дата% >= &НачалоПериода
			|";
			
		Если СтрокаТЗ.Предопределенный
		 Или СтрокаТЗ.ВидСобытия = Перечисления.МИКО_мвВидыЗначимыхСобытий.ВходящийЗвонок
		 Или СтрокаТЗ.ВидСобытия = Перечисления.МИКО_мвВидыЗначимыхСобытий.ИсходящийЗвонок Тогда
			ТекстЗапросаПоОбъекту = СтрЗаменить(ТекстЗапросаПоОбъекту, "%ВидСобытия%",   "Документ");
			ТекстЗапросаПоОбъекту = СтрЗаменить(ТекстЗапросаПоОбъекту, "%ВидОбъекта%",   "МИКО_стЗаписьИсторииЗвонков");
			ТекстЗапросаПоОбъекту = СтрЗаменить(ТекстЗапросаПоОбъекту, "%Дата%",         "Дата");
		Иначе
			ТекстЗапросаПоОбъекту = СтрЗаменить(ТекстЗапросаПоОбъекту, "%ВидСобытия%",   СтрокаТЗ.ВидСобытия);
			ТекстЗапросаПоОбъекту = СтрЗаменить(ТекстЗапросаПоОбъекту, "%ВидОбъекта%",   СтрокаТЗ.ВидОбъекта);
			ТекстЗапросаПоОбъекту = СтрЗаменить(ТекстЗапросаПоОбъекту, "%Дата%",         СтрокаТЗ.НаименованиеПоляДата);
		КонецЕсли;
		
		Если ПустаяСтрока(ТекстЗапросаПоОбъектам) Тогда
			ТекстЗапросаПоОбъектам = ТекстЗапросаПоОбъекту;
		Иначе
			ТекстЗапросаПоОбъектам = ТекстЗапросаПоОбъектам + Символы.ПС +
				"ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + Символы.ПС + ТекстЗапросаПоОбъекту;
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Объекты.Ссылка
		|ИЗ
		|	(%ТекстЗапросаПоОбъектам%) КАК Объекты";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ТекстЗапросаПоОбъектам%", ТекстЗапросаПоОбъектам);
	
	// Граница периода обрабатываемых данных определяется по максимуму
	// срока действия всех регистрируемых событий.
	Если ТаблицаВидовСобытий.Количество() > 0 Тогда
		МаксСрокДействияВДнях = МИКО_стОбщегоНазначения.НайтиСтрокуСМаксимальнымЗначениеВТаблице(ТаблицаВидовСобытий, "СрокДействия").СрокДействия;
	Иначе
		МаксСрокДействияВДнях = 0;
	КонецЕсли; 
	
	НачалоПериода = НачалоДня(ТекущаяДата() - МаксСрокДействияВДнях * 86400);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	ОбходЗапроса = РезультатЗапроса.Выбрать();
	
	Пока ОбходЗапроса.Следующий() Цикл
		мМИКО_мвМаршрутизацияЗвонковСервер.ЗарегистрироватьСобытие(ОбходЗапроса.Ссылка, Истина);
	КонецЦикла;
	
КонецПроцедуры // ОбновитьТаблицуЗначимыхСобытий()

Функция СформироватьСтрокуПриветствия(НомерТелефона)
	
	Попытка
		мМИКО_мвМаршрутизацияЗвонковСервер = Вычислить("МИКО_мвМаршрутизацияЗвонковСервер");	
	Исключение
		Возврат НомерТелефона;
	КонецПопытки;
	
	Возврат мМИКО_мвМаршрутизацияЗвонковСервер.СформироватьСтрокуПриветствия(НомерТелефона);
	
КонецФункции

&НаКлиенте
Процедура ИзменитьСоставИмени(Команда)
	
	ВыбранныйЭлемент = Новый Структура("Значение", "ИзменитьСоставИмени");
	врПараметры = Новый Структура("Меню", "#Сотрудники");
	ПослеВыбораЭлементаМеню(ВыбранныйЭлемент, врПараметры);	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПадеж(Команда)
	
	ВыбранныйЭлемент = Новый Структура("Значение", "ИзменитьПадеж");
	врПараметры = Новый Структура("Меню", "#Сотрудники");
	ПослеВыбораЭлементаМеню(ВыбранныйЭлемент, врПараметры);	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СОТРУДНИКИ.

&НаСервере
// Наполнение списка сотрудников.
// 
Процедура ПриСозданииНаСервереСписокСотрудников()
	
	ИерархическийСправочник 	= Метаданные.Справочники.Пользователи.Иерархический;
	ЕстьРеквизитНедействителен 	= Метаданные.Справочники.Пользователи.Реквизиты.Найти("Недействителен")<>Неопределено;
	
	// Заполним таблицу пользователей данными из РС "МИКО_мвДанныеПользователей".
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(МИКО_мвДанныеПользователей.УчаствуетВГолосовомМеню, 0) = 0
		|			ТОГДА НЕ Пользователи.ПометкаУдаления
		|		ИНАЧЕ МИКО_мвДанныеПользователей.УчаствуетВГолосовомМеню
		|	КОНЕЦ КАК УчаствуетВГолосовомМеню,
		|	ЕСТЬNULL(МИКО_мвДанныеПользователей.ФИО_РП, """") КАК ФИО_РП,
		|	ЕСТЬNULL(МИКО_мвДанныеПользователей.ФИО_ДП, """") КАК ФИО_ДП,
		|	ЕСТЬNULL(МИКО_мвДанныеПользователей.ФИО_ВП, """") КАК ФИО_ВП,
		|	ЕСТЬNULL(МИКО_мвДанныеПользователей.ФИО_ТП, """") КАК ФИО_ТП,
		|	ЕСТЬNULL(МИКО_мвДанныеПользователей.ФИО_ПП, """") КАК ФИО_ПП,
		|	ЕСТЬNULL(МИКО_мвДанныеПользователей.ПериодНачало, ДАТАВРЕМЯ(1,1,1,0,0,0)) КАК ПериодНачало,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(МИКО_мвДанныеПользователей.Пользователь, 0) = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОбновитьИнформацию,
		|	ЕСТЬNULL(МИКО_мвДанныеПользователей.ПолПользователя, """") КАК ПолПользователя,
		|	Пользователи.Ссылка КАК Пользователь,
		|	//ПолеНедействителен//
		|	Пользователи.Ссылка.Наименование КАК ФИОПользователя
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МИКО_мвДанныеПользователей КАК МИКО_мвДанныеПользователей
		|		ПО (МИКО_мвДанныеПользователей.Пользователь = Пользователи.Ссылка)
		|";
				   
	Если ИерархическийСправочник Тогда
		Запрос.Текст = Запрос.Текст + 
			"ГДЕ
	   		|	НЕ Пользователи.ЭтоГруппа
			|";
	КонецЕсли;
		
	Запрос.Текст = Запрос.Текст + 
		"УПОРЯДОЧИТЬ ПО
		|	ФИОПользователя";
				   
	Если ЕстьРеквизитНедействителен Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ПолеНедействителен//", "Пользователи.Недействителен ИЛИ Пользователи.ПометкаУдаления КАК Неактивен,");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ПолеНедействителен//", "Пользователи.ПометкаУдаления КАК Неактивен,");
	КонецЕсли; 
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	СписокПользователей.Загрузить(Результат.Выгрузить());
	
	Для Каждого СтрокаТЗ Из СписокПользователей Цикл
		ОбновитьСтатусЗаполнениПараметровСклонения(СтрокаТЗ);
	КонецЦикла;
	
	// Получим системную информацию
	УстановитьНачальныеОтборы();

КонецПроцедуры

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СписокПользователейПользовательПриИзменении(Элемент)
	ПометитьМодифицированность(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейПолПользователяПриИзменении(Элемент)
	ПометитьМодифицированность(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейУчаствуетВСинтезеГолосовогоМенюПриИзменении(Элемент)
	ПометитьМодифицированность(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейФИО_РППриИзменении(Элемент)
	ПометитьМодифицированность(Элемент);
	ОбновитьСтатусЗаполнениПараметровСклонения(Элементы.СписокПользователей.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейФИО_ДППриИзменении(Элемент)
	ПометитьМодифицированность(Элемент);
	ОбновитьСтатусЗаполнениПараметровСклонения(Элементы.СписокПользователей.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейФИО_ВППриИзменении(Элемент)
	ПометитьМодифицированность(Элемент);
	ОбновитьСтатусЗаполнениПараметровСклонения(Элементы.СписокПользователей.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейФИО_ТППриИзменении(Элемент)
	ПометитьМодифицированность(Элемент);
	ОбновитьСтатусЗаполнениПараметровСклонения(Элементы.СписокПользователей.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейФИО_ПППриИзменении(Элемент)
	ПометитьМодифицированность(Элемент);
	ОбновитьСтатусЗаполнениПараметровСклонения(Элементы.СписокПользователей.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейОбновитьИнформациюПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Истина;
	ПроверитьИзмененияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНедействителенПриИзменении(Элемент)
	
	Если ТолькоАктивные Тогда
		Элементы.СписокПользователей.ОтборСтрок = Новый ФиксированнаяСтруктура("Неактивен", Ложь);
	Иначе
		Элементы.СписокПользователей.ОтборСтрок = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейПериодНачалоПриИзменении(Элемент)
	ПометитьМодифицированность(Элемент);
КонецПроцедуры

// КОМАНДЫ ФОРМЫ

&НаКлиенте
Процедура Заполнить(Команда)
	
	СотрудникиСохранитьНаСервере();
	Закрыть();
	
КонецПроцедуры

// Заполняет ТЗ списком пользователей из справочника пользователей
&НаСервере
Процедура СотрудникиСохранитьНаСервере()
	
	Для каждого СтрПользователь Из СписокПользователей Цикл
		
		Если НЕ СтрПользователь.ОбновитьИнформацию Тогда
			Продолжить;
		КонецЕсли; 
		
		МенеджерЗаписи = РегистрыСведений.МИКО_мвДанныеПользователей.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрПользователь);
		
		Попытка
			МенеджерЗаписи.Записать();
			СтрПользователь.ОбновитьИнформацию = Ложь;
		Исключение
			
		КонецПопытки;
		
	КонецЦикла;
	ОбновитьПримерОповещенияГолосовогоМеню();
	ЭтаФорма.Модифицированность = Ложь;
	
КонецПроцедуры // СотрудникиСохранитьНаСервере()

&НаСервере
Процедура ПросклонятьНаСервере(Пользователь = Неопределено)
	
	// Просклоняем ФИО пользоватлей
	Попытка
		ПодключитьВнешнююКомпоненту("ОбщийМакет.МИКО_мвКомпонентаСклоненияФИО", "Decl");
		Компонента = Новый("AddIn.Decl.CNameDecl");
	Исключение
		Компонента = Неопределено;
		МИКО_стОбщегоНазначенияСервер.СообщитьПользователю("Не удалось подключить компоненту для склонения имени. Поробуйте просклонять вручную");
		Возврат;
	КонецПопытки;
	Попытка
		мМИКО_мвМаршрутизацияЗвонковСервер = Вычислить("МИКО_мвМаршрутизацияЗвонковСервер");	
	Исключение
		Возврат;	
	КонецПопытки; 
	
	Модифицированность = Истина;
	Для каждого СтрокаТЗ Из СписокПользователей Цикл
		
		Если Пользователь <> Неопределено И СтрокаТЗ.Пользователь <> Пользователь Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТЗ.ПолПользователя = Перечисления.МИКО_мвПолПользователей.Мужской Тогда
			Пол = 1;
		ИначеЕсли СтрокаТЗ.ПолПользователя = Перечисления.МИКО_мвПолПользователей.Женский Тогда
			Пол = 2;
		Иначе
			Пол = 0;
		КонецЕсли;
		
		мМИКО_мвМаршрутизацияЗвонковСервер.ПросклонятьФразуКомпонента(Компонента, СтрокаТЗ.ФИОПользователя,2,СтрокаТЗ.ФИО_РП,Пол);
		мМИКО_мвМаршрутизацияЗвонковСервер.ПросклонятьФразуКомпонента(Компонента, СтрокаТЗ.ФИОПользователя,3,СтрокаТЗ.ФИО_ДП,Пол);
		мМИКО_мвМаршрутизацияЗвонковСервер.ПросклонятьФразуКомпонента(Компонента, СтрокаТЗ.ФИОПользователя,4,СтрокаТЗ.ФИО_ВП,Пол);
		мМИКО_мвМаршрутизацияЗвонковСервер.ПросклонятьФразуКомпонента(Компонента, СтрокаТЗ.ФИОПользователя,5,СтрокаТЗ.ФИО_ТП,Пол);
		мМИКО_мвМаршрутизацияЗвонковСервер.ПросклонятьФразуКомпонента(Компонента, СтрокаТЗ.ФИОПользователя,6,СтрокаТЗ.ФИО_ПП,Пол);
		
		ОбновитьСтатусЗаполнениПараметровСклонения(СтрокаТЗ);
		
		СтрокаТЗ.ОбновитьИнформацию = Истина;
	КонецЦикла;
	
КонецПроцедуры
&НаКлиенте
Процедура Просклонять(Команда)
	
	Если Элементы.СписокПользователей.ТекущиеДанные <> Неопределено Тогда
		ПросклонятьНаСервере(Элементы.СписокПользователей.ТекущиеДанные.Пользователь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПросклонятьВсе(Команда)
	
	ПросклонятьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПараметры(Команда)
	
	Если Элементы.ПоказатьПараметры.Пометка = Ложь Тогда
		
		Элементы.ГруппаПараметрыСклонения.Видимость = Истина;
		Элементы.ПоказатьПараметры.Пометка = Истина;
		
	Иначе
		
		Элементы.ГруппаПараметрыСклонения.Видимость = Ложь;
		Элементы.ПоказатьПараметры.Пометка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиТаблицаМаршрутизации(Команда)
	
	ОткрытьФорму("РегистрСведений.МИКО_мвТаблицаМаршрутизации.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиЗначимыеСобытияДляМаршрутизации(Команда)
	
	ОткрытьФорму("РегистрСведений.МИКО_мвЗначимыеСобытияДляМаршрутизации.ФормаСписка");
	
КонецПроцедуры

// ПРОЧЕЕ

&НаКлиенте
Процедура ПометитьМодифицированность(Элемент)
	
	Если Элемент = Неопределено ИЛИ Элементы.СписокПользователей.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ЭтаФорма.Модифицированность = Истина;
	Элементы.СписокПользователей.ТекущиеДанные.ОбновитьИнформацию = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИзмененияНаСервере()

	Для каждого СтрДанных Из СписокПользователей Цикл
		Если СтрДанных.ОбновитьИнформацию Тогда
			Возврат;
		КонецЕсли; 
	КонецЦикла; 

	ЭтаФорма.Модифицированность = Ложь;
	
КонецПроцедуры // ПроверитьИзмененияНаСервере()

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСтатусЗаполнениПараметровСклонения(СтрокаТаблицы)
	
	СтрокаТаблицы.ПараметрыСклоненияУказаны = 
		ЗначениеЗаполнено(СтрокаТаблицы.ФИО_РП) Или 
		ЗначениеЗаполнено(СтрокаТаблицы.ФИО_ДП) Или 
		ЗначениеЗаполнено(СтрокаТаблицы.ФИО_ТП) Или 
		ЗначениеЗаполнено(СтрокаТаблицы.ФИО_ВП) Или 
		ЗначениеЗаполнено(СтрокаТаблицы.ФИО_ПП);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНачальныеОтборы()

	ТолькоАктивные = Истина;
	Элементы.СписокПользователей.ОтборСтрок = Новый ФиксированнаяСтруктура("Неактивен", Ложь);

КонецПроцедуры // УстановитьОтборы()
&НаКлиенте
Процедура СписокПользователейПользовательОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
&НаКлиенте
Процедура СписокПользователейПользовательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
&НаКлиенте
Процедура НадписьПриветствиеСотрудникиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Элементы.СтраницыНастроек.ТекущаяСтраница = Элементы.Сотрудники;
КонецПроцедуры
&НаКлиенте
Процедура НадписьПриветствиеСотрудникиОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
&НаКлиенте
Процедура НадписьПриветствиеСотрудникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Лицензирование(Команда)
	Попытка
		мМИКО_Лицензирование = Вычислить("МИКО_Лицензирование");	
	Исключение
		Возврат;	
	КонецПопытки; 
	НастройкиФормы = Новый Структура;
	НастройкиФормы.Вставить("ИдентификаторПродукта", "9");
	НастройкиФормы.Вставить("СведенияОПродукте", мМИКО_Лицензирование.ПолучитьСведенияОПродукте("Модуль умной маршрутизации"));
	
	ОткрытьФорму("ОбщаяФорма.МИКО_РегистрацияПродукта", НастройкиФормы, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор);
	// ОткрытьФорму("ПланВидовХарактеристик.МИКО_стНастройкиТелефонии.Форма.Настройки", НастройкиФормы, ЭтаФорма);
КонецПроцедуры


// #КонецОбласти
